import Collection from "@/models/collection.js";
import Dhikr from "@/models/dhikr.js";

export const dailyCollection = new Collection('اذکار روزانه', [
    new Dhikr(
        'سبحان الله',
        '',
        'سبحان الله',
        'پاک و منزه است الله',
        33
    ),
    new Dhikr(
        'الحمد لله',
        '',
        'الحمد لله',
        'ستایش مخصوص الله است',
        33
    ),
    new Dhikr(
        'الله أكبر',
        '',
        'الله أكبر',
        'الله بزرگ‌تر است',
        33
    ),
    new Dhikr(
        'لا إله إلا الله',
        '',
        'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير',
        'هیچ معبودی جز الله نیست، یکتاست و شریکی ندارد، پادشاهی و ستایش از آن اوست و او بر هر چیزی تواناست',
        100
    ),
    new Dhikr(
        'أستغفر الله',
        '',
        'أستغفر الله',
        'از الله آمرزش می‌طلبم',
        100
    ),
    new Dhikr(
        'صلوات',
        '',
        'اللهم صل على محمد وعلى آل محمد',
        'خدایا بر محمد و خاندان محمد درود فرست',
        100
    ),
    new Dhikr(
        'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
        '',
        'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ',
        'پاک و منزه است الله و ستایش مخصوص اوست',
        100
    ),
    new Dhikr(
        'آیة الکرسی',
        'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
        `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.`,
        `هیچ معبودی جز او نیست. زنده و پایدار است. نه خوابش می‌گیرد و نه چرتش. آنچه در آسمان‌ها و آنچه در زمین است از آن اوست. کیست که در نزد او جز به اذن او شفاعت کند؟ آنچه در پیش روی آنهاست و آنچه در پشت سرشان است را می‌داند. و کسی به چیزی از علم او احاطه نمی‌یابد مگر به آنچه بخواهد. و کرسی او آسمان‌ها و زمین را در برگرفته و نگه‌داری آن دو (زمین و آسمان) برای او سخت نیست و او متعالی و بزرگ است.`,
        1
    ),
    new Dhikr(
        'استعاذه',
        '',
        'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
        'به الله از شیطان رانده شده پناه می‌برم',
        7
    ),
    new Dhikr(
        'حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ',
        '',
        'حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ',
        'خدا ما را کافی است و او بهترین حامی است',
        7
    )
]); 