import Collection from "@/models/collection.js";
import Dhikr from "@/models/dhikr.js";

export const istikharaCollection = new Collection('دعاء استخاره', [
    new Dhikr(
        'دعاء استخاره',
        '',
        'اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي (عَاجِلِ أَمْرِي وَآجِلِهِ) فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي (عَاجِلِ أَمْرِي وَآجِلِهِ) فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي (رضِّنِيِ بِه)',
        'بار الها به وسیله علمت از تو طلب خیر می‌کنم و به وسیله قدرتت از تو توانایی می خواهم و از تو فضل و بزرگی ات را مسئلت می نمایم. زیرا تو قادر و توانایی و من توانایی ندارم، و تو می دانی و من نمی دانم و تو به امورات غیب و پنهانی آگاه هستی. خدایا! اگر می دانی این كار در دین و در امور زندگی و در سرانجام كارم چه در دنیا و چه در آخرت برایم نیكو است آن را برایم مقدر و آسان كرده و در آن برکت انداز و اگر می‎دانی این كار در دین و در امور زندگی و در سرانجام كارم چه در دنیا و چه در آخرت باعث شر و بدی است آن را از من دور فرما و مرا از از آن دور نما و خیر و نیکویی را هر كجا باشد برایم مقدر نموده و سپس مرا راضی و خشنود بگردان',
        1
    )
]);