import Collection from "@/models/collection.js";
import Dhikr from "@/models/dhikr.js";

export const morningCollection = new Collection('اذکار صبحگاه', [
    new Dhikr(
        'آیة الکرسی',
        'أَعُوذُ بِاللهِ مِنْ الشَّیْطَانِ الرَّجِیمِ',
        `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَیُّ الْقَیُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِی السَّمَاوَاتِ وَمَا فِی الأَرْضِ مَن ذَا الَّذِی یَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ یَعْلَمُ مَا بَیْنَ أَیْدِیهِمْ وَمَا خَلْفَهُمْ وَلاَ یُحِیطُونَ بِشَیْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِیُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ یَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِیُّ الْعَظِیمُ.`,
        '‏خدائی بجز الله وجود ندارد و او زنده پایدار ( و جهان هستی را ) نگهدار است . او را نه چرتی و نه خوابی فرا نمی‌گیرد ( و همواره بیدار است و سستی و رخوت بدو راه ندارد ) . از آنِ او است آنچه در آسمانها و آنچه در زمین است ( و در ملك كائنات ، او را انبازی نیست ) . كیست آن كه در پیشگاه او میانجیگری كند مگر با اجازه او ؟ می‌داند آنچه را كه در پیش روی مردمان است و آنچه را كه در پشت سر آنان است ( و مطلع بر گذشته و حال و آینده ، و آگاه بر بود و نبود جهان است و اصلاً همه زمانها و مكانها در پیشگاه علم او یكسان است . مردمان ) چیزی از علم او را فراچنگ نمی‌آورند جز آن مقداری را كه وی بخواهد .  ( علم و دانش محدود دیگران ، پرتوی از علم بی‌پایان و بی‌كران او است ) . فرماندهی و فرمانروائی او آسمانها و زمین را دربر گرفته است ، و نگاهداری آن دو ( برای او گران نیست و ) وی را درمانده نمی‌سازد و او بلندمرتبه و سترگ است .‏',
        1
    ),
    new Dhikr(
        'سوره ی اخلاص',
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِیم',
        `قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ یَلِدْ وَلَمْ یُولَدْ، وَلَمْ یَكُن لَّهُۥ كُفُوًا أَحَدٌۢ`,
        `
        ‏بگو : خدا ، يگانه يكتا است .‏
        ‏خدا ، سَرورِ والاي برآورنده اميدها و برطرف كننده نيازمنديها است .‏
        ‏نزاده است و زاده نشده است .‏
        ‏و كسي همتا و همگون او نمیباشد .‏
        `,
        3
    ),
    new Dhikr(
        'سوره ی فلق',
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِیم',
        'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ',
        `
        ‏بگو : پناه میبرم به خداوندگار سپيده‌دم .‏
        ‏از شر هر آنچه خداوند آفريده است .‏
        ‏و از شرّ شب بدان گاه كه كاملاً فرا میرسد ( و جهان را به زير تاريكي خود میگيرد ) .‏
        ‏و از شرّ كساني كه در گره‌ها میدمند ( و با نيرنگ‌سازي و حقه‌بازيِ خود ، اراده‌ها ، ايمانها ، عقيده‌ها ، محبّتها ، و پيوندها را سست مینمايند و فساد و تباهي میكنند ) .‏
        ‏و از شرّ حسود بدان گاه كه حسد میورزد .‏
        `,
        3
    ),
    new Dhikr(
        'سوره ی ناس',
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِیم',
        'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى یُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ',
        `
        ‏بگو : پناه می‌برم به پروردگار مردمان‌‏
        ‏به مالك و حاكم ( واقعی ) مردمان .‏
        ‏به معبود ( به حقّ ) مردمان .‏
        ‏از شر وسوسه‌گری كه واپس می‌رود ( اگر برای چیره‌شدن بر او ، از خدا كمك بخواهی و خویشتن را در پناهش داری ) .‏
        ‏وسوسه‌گری است كه در سینه‌های مردمان به وسوسه می‌پردازد ( و ایشان را به سوی زشتی و گناه و ترك خوبیها و واجبات می‌خواند ) .‏
        ‏( در سینه‌های مردمانی ) از جنّیها و انسانها .‏
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَریكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَیءٍ قدیر ، رَبِّ أسْـأَلُـكَ خَـیرَ ما فی هـذا الیوم وَخَـیرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما فی هـذا الیوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ فی النّـارِ وَعَـذابٍ فی القَـبْر',
        'ما و تمام جهانیان، شب را براى خدا به صبح رسانیدیم، و حمد از آن خداست، هیچ معبودى، بجز الله که یکتاست و شریکى ندارد وجود ندارد. پادشاهى و حمد فقط از آن اوست و او بر هر چیز قادر است. الهى! من خیر آنچه در این روز است و خیر آنچه بعد از آن است را از از تو مىطلبم، و از شرّ آنچه که در این روز و ما بعد آن، وجود دارد، به تو پناه می‌ىبرم. الهى! من از تنبلى و بدی‏هاى پیرى به تو پناه می‌ىبرم، بار الها! من از عذاب آتش و قبر به تو پناه مى برم.',
        1
    ),
    new Dhikr(
        '',
        '',
        'اللّهـمَّ أَنْتَ رَبِّـی لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـی وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـیَّ وَأَبـوءُ بِذَنْـبی فَاغْفـِرْ لی فَإِنَّـهُ لا یَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
        'الهى! تو پروردگار من هستى، بجز تو معبود دیگرى نیست، تو مرا آفریدى، و من بنده ‏ى تو هستم، و بر پیمان و عده‏ام با تو بر حسب استطاعت خود، پایبند هستم، و از شر آنچه که انجام داده‏ام به تو پناه می‌برم، به نعمتى که به من عطا فرموده ‏اى، اعتراف می‌کنم، و به گناهم اقرار می‌نمایم، پس مرا ببخشاى، چرا که بجز تو کسى گناهان را نمى‌ بخشاید',
        1
    ),
    new Dhikr(
        '',
        '',
        'رَضیـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ دیـناً وَبِمُحَـمَّدٍ صلى الله علیه وسلم نَبِیّـاً',
        'به ربوبیت الله، و به داشتن دین اسلام، و پیامبرى محمد –صلى الله علیه وسلم- راضى و خشنود هستم',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ إِنِّـی أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـیعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَریكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
        'الهى! من در این صبح گاه، تو را و حاملان عرش و تمام فرشتگانت و کلیّه مخلوقات تو را گواه می‌گیرم بر این که تو الله هستى، بجز تو معبود دیگرى «بحق» وجود ندارد، تو یگانه‏اى و شریکى ندارى، و محمد –صلى الله علیه وسلم- بنده و فرستاده‏ ى تو است',
        4
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ ما أَصْبَـَحَ بی مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شریكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر',
        'الهى! هر نعمتى که در این صبح، شامل حال من یا یکى از مخلوقات شده، از طرف تو بوده است، تو شریکى ندارى، پس ستایش و شکر از آنِ تو است.',
        1
    ),
    new Dhikr(
        '',
        '',
        'حَسْبِـیَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـیهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـیم',
        'الله براى من کافى است، بجز او معبود دیگرى «بحق» نیست، بر تو توکّل کردم و او پروردگار عرش بزرگ است',
        7
    ),
    new Dhikr(
        '',
        '',
        'بِسـمِ اللهِ الذی لا یَضُـرُّ مَعَ اسمِـهِ شَیءٌ فی الأرْضِ وَلا فی السّمـاءِ وَهـوَ السّمـیعُ العَلـیم',
        'به نام خدایى که با نام وى هیچ چیز در زمین و آسمان، گزندى نمی‌رساند، و او شنوا و دانا است',
        3
    ),
    new Dhikr(
        '',
        '',
        'أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِینِ نَبِیِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَیْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِینَا إبْرَاهِیمَ حَنِیفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِینَ',
        'ما بر فطرت اسلام، کلمه‏ ى اخلاص، دین پیامبرمان محمد –صلى الله علیه وسلم- و آئین پدرمان ابراهیم؛ صبح کردیم، همان ابراهیمی‌که فقط به سوى حقّ، تمایل داشت و فرمان‌بردار خداوند بود، و از مشرکان نبود',
        1
    ),
    new Dhikr(
        '',
        '',
        'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه',
        'تسبیح و پاکى الله و ستایش او را به تعداد آفریدگانش خشنود‏ىاش و سنگینى عرشش و جوهر سخنانش، بیان می‌نمایم.',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ عافِـنی فی بَدَنـی ، اللّهُـمَّ عافِـنی فی سَمْـعی ، اللّهُـمَّ عافِـنی فی بَصَـری ، لا إلهَ إلاّ أَنْـتَ',
        'بار الها! در بدنم عافیت ده، بار الها! در گوشم عافیت ده، خدایا! در چشمم عافیت ده، بجز تو معبود دیگرى «بحق» وجود ندارد، از کفر به تو پناه می‌برم، از فقر به تو پناه می‌برم، از عذاب قبر به تو پناه می‌برم، بجز تو معبود دیگرى «بحق» وجود ندارد.',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ إِنّـی أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ',
        'بار الها! در بدنم عافیت ده، بار الها! در گوشم عافیت ده، خدایا! در چشمم عافیت ده، بجز تو معبود دیگرى «بحق» وجود ندارد، از کفر به تو پناه می‌برم، از فقر به تو پناه می‌برم، از عذاب قبر به تو پناه می‌برم، بجز تو معبود دیگرى «بحق» وجود ندارد.',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ إِنِّـی أسْـأَلُـكَ العَـفْوَ وَالعـافِـیةَ فی الدُّنْـیا وَالآخِـرَة ، اللّهُـمَّ إِنِّـی أسْـأَلُـكَ العَـفْوَ وَالعـافِـیةَ فی دینی وَدُنْـیایَ وَأهْـلی وَمالـی ، اللّهُـمَّ اسْتُـرْ عـوْراتی وَآمِـنْ رَوْعاتـی ، اللّهُـمَّ احْفَظْـنی مِن بَـینِ یَدَیَّ وَمِن خَلْفـی وَعَن یَمـینی وَعَن شِمـالی ، وَمِن فَوْقـی ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـی',
        'الهى! عفـو و عافیت دنـیا و آخرت را از تـو می‌خواهم. بار الها! عفو و عافیت دین، دنیا، خانواده و مالم را از تو مسألت مىنمایم. بار الها! عیوب مرا بپوشان و ترس مرا به ایمنى مبدّل ساز. الهى! مرا از جلو، پشت سر، سمت راست و چپ و بالاى سرم، محافظت بفرما، و به بزرگى و عظمت تو پناه می‌برم از اینکه بطور ناگهانى از طرف پایین کشته شوم.',
        1
    ),
    new Dhikr(
        '',
        '',
        'یَا حَیُّ یَا قیُّومُ بِرَحْمَتِكَ أسْتَغِیثُ أصْلِحْ لِی شَأنِی كُلَّهُ وَلاَ تَكِلْنِی إلَى نَفْسِی طَـرْفَةَ عَیْنٍ',
        'اى زنـده و پا بـرجا! بـه وسیله‏ ى رحمت تـو از تـو کمک می‌خواهم، همه‏ ى امورم را اصلاح بفرما، و مرا به اندازه‏ ى یک چشم به هم زدن به حال خود رها مکن',
        3
    ),
    new Dhikr(
        '',
        '',
        'أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـین ، اللّهُـمَّ إِنِّـی أسْـأَلُـكَ خَـیْرَ هـذا الـیَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـیهِ وَشَـرِّ ما بَعْـدَه',
        'ما و تمام جهانیان، شب را به صبح رسانیدیم براى خدایى که پروردگار جهانیان است. بار الها! من از تو خوبى امروز، یعنى فتح، پیروزى، نور، برکت و هدایتش را مسألت می‌نمایم از بدى آنچه ‏امروز و بعد از آن، پیش می‌آید، به تو پناه می‌برم',
        1
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ عالِـمَ الغَـیْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـیءٍ وَمَلیـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـی وَمِن شَـرِّ الشَّیْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـی سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم',
        'بار الها! اى داننده‏ى نهان و آشکار، آفریدگار آسمان‏ها و زمین، پروردگار و مالک هر چیز، من گواهى می‌دهم که بجز تو، معبود دیگرى نیست، از شرّ نفس و از شرّ شیطان و دام فریبش، و از اینکه خود مرتکب کار بدى شوم و یا به مسلمانى، بدى برسانم، به تو پناه می‌برم',
        1
    ),
    new Dhikr(
        '',
        '',
        'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق',
        '',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِیِّنَا مُحمَّد',
        'بار الها! بر پیامبرمان محمد –صلى الله علیه وسلم- سلام و درود بفرست',
        10
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَیْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ',
        '',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ إِنِّی أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّیْنِ، وَقَهْرِ الرِّجَالِ',
        '',
        3
    ),
    new Dhikr(
        '',
        '',
        'أسْتَغْفِرُ اللهَ العَظِیمَ الَّذِی لاَ إلَهَ إلاَّ هُوَ، الحَیُّ القَیُّومُ، وَأتُوبُ إلَیهِ',
        '',
        3
    ),
    new Dhikr(
        '',
        '',
        'یَا رَبِّ , لَكَ الْحَمْدُ كَمَا یَنْبَغِی لِجَلَالِ وَجْهِكَ , وَلِعَظِیمِ سُلْطَانِكَ',
        '',
        3
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ إِنِّی أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَیِّبًا، وَعَمَلًا مُتَقَبَّلًا',
        'بار الها! از تو علم سودمند، رزق پاک و عمل مقبول مسألت می‌نمایم',
        1
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ أَنْتَ رَبِّی لا إِلَهَ إِلا أَنْتَ ، عَلَیْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِیمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ یَشَأْ لَمْ یَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِیِّ الْعَظِیمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَیْءٍ قَدِیرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَیْءٍ عِلْمًا , اللَّهُمَّ إِنِّی أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِی ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِیَتِهَا ، إِنَّ رَبِّی عَلَى صِرَاطٍ مُسْتَقِیمٍ',
        '',
        1
    ),
    new Dhikr(
        '',
        '',
        'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِیكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَیْءِ قَدِیرِ',
        'بجز الله معبود دیگرى «بحق» نیست، او شریکى ندارد، پادشاهى از آنِ اوست، و او بر هر چیز توانا است',
        100
    ),
    new Dhikr(
        '',
        '',
        'سُبْحـانَ اللهِ وَبِحَمْـدِهِ',
        '',
        100
    ),
    new Dhikr(
        '',
        '',
        'أسْتَغْفِرُ اللهَ وَأتُوبُ إلَیْهِ',
        '',
        100
    ),
]);