import Collection from "@/models/collection.js";
import Dhikr from "@/models/dhikr.js";

export const nightCollection = new Collection('اذکار شامگاه', [
    new Dhikr(
        'آیة الکرسی',
        'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ',
        `اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.`,
        `
        هیچ ﻣﻌﺒﻮدی ﺑﺮ ﺣﻖ ﺟﺰ او ﻧﯿﺴﺖ. زﻧﺪه ی پایدار و نگه دارﻧﺪه ی ﻋﺎﻟﻢ اﺳﺖ، ﻧﻪ چُرت او را ﻓﺮا می‌گیرد و ﻧﻪ ﺧﻮاب، آنچه در آﺳﻤﺎن ﻫﺎ و آنچه در زﻣﯿﻦ اﺳﺖ از آن اوﺳﺖ، کیست که در ﻧﺰد او ﺟﺰ ﺑﻪ ﻓﺮﻣﺎن او ﺷﻔﺎﻋﺖ کند؟ آﻧچه در پیش روی آﻧﺎن و آنچه در پشت ﺳﺮﺷﺎن اﺳﺖ می‌داند. و کسی ﺑﻪ چیزی ازﻋﻠﻢ او ﺟﺰ ﺑﻪ آنچه ﺑﺨﻮاﻫﺪ اﺣﺎﻃﻪ نمی ﯾﺎﺑﻨﺪ، کرسی او آﺳﻤﺎن ﻫﺎ و زﻣﯿﻦ را در ﺑﺮ گرﻓﺘﻪ، و ﻧگﻬﺪاری آن دو (زﻣﯿﻦ و آﺳﻤﺎن) ﺑﺮای او ﺳﺨﺖ و دﺷﻮار ﻧﯿﺴﺖ، و او ﻣﺘﻌﺎلی (ﺑﺮ ﻋﺮش) و ﺑﻠﻨﺪ ﻣﺮﺗﺒﻪ و ﺑﺰرگ اﺳﺖ.
        `,
        1
    ),
    new Dhikr(
        'سوره اخلاص',
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
        `قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ`,
        `
        (ای پیامبر) بگو: او الله یکتا و یگانه است.
        الله بی نیاز است (و همه نیازمند او هستند) .
        نه (فرزندی) زاده و نه زاده شده است.
        و هیچ کس همانند و همتای او نبوده و نیست.
        `,
        3
    ),
    new Dhikr(
        'سوره فلق',
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
        'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ',
        `
        (ای پیامبر) بگو به پروردگار سپیده‌دم پناه می‌برم.
        از شر تمام آنچه آفریده است.
        و از شر تاریکی شب، آن‌گاه که همه جا را فراگیرد.
        و از شر (ساحران) که با افسون در گره ها می‌دمند.
        و از شر حسود، آن‌گاه که حسد ورزد.
        `,
        3
    ),
    new Dhikr(
        'سوره ناس',
        'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم',
        'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ',
        `
        (ای پیامبر) بگو: به پروردگار مردم پناه می‌برم.
        فرمانروای مردم.
        اله (و معبود) مردم.
        از شر (شیطان) وسوسه گر بازپس رونده (به هنگام ذکر الله).
        همان که در دلهای مردم وسوسه می‌کند.
        از جنیان (باشد) و (یا از) آدمیان.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر',
        `
        ﺻﺒﺢ را ﺑﻪ ﺷﺐ رﺳﺎﻧﺪﯾﻢ و ملک از آن ﷲ گشت
        و ﺣﻤﺪ و ﺳﺘﺎﯾﺶ ﷲ را، هیچ ﻣﻌﺒﻮد (ﺑﺮ حقی) ﺟﺰ او ﻧﯿﺴﺖ؛
        یکتاست و ﺷﺮیکی ﻧﺪارد، ملک از آن اوﺳﺖ،
        و ﺣﻤﺪ و ﺳﺘﺎﯾﺶ ﺷﺎﯾﺴﺘﻪ ی اوﺳﺖ و او ﺑﺮ ﻫﻤﻪ چیز ﺗﻮاﻧﺎﺳﺖ.
        پروردگارا از ﺗﻮ ﺧﯿﺮ ِ آنچه در اﯾﻦ ﺷﺐ اﺳﺖ
        و ﺧﯿﺮ ِ ﺑﻌﺪ از آن را ﻣﺴﺄﻟﺖ دارم، و از ﺷﺮ ّ اﯾﻦ ﺷﺐ و ﺷﺮ ّ ﺑﻌﺪ از آن،
        ﺑﻪ ﺗﻮ پناه می‌برم. پروردگارا از تنبلی و ﺑﺪی ِ پیری ﺑﻪ ﺗﻮ پناه می‌برم.
        پروردگارا از ﻋﺬاب آﺗﺶ و ﻋﺬاب ﻗﺒﺮ ﺑﻪ ﺗﻮ پناه می‌برم.
        `,
        1
    ),
    new Dhikr(
        '',
        '',
        'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ',
        `بارالها تو پروردگار منی، جز تو معبودی بر حق نیست، تو مرا آفریده‌ای و من بنده توام و بر عهد و پیمان تو به قدر توان ایستاده‌ام، و از شر کارهای زشتی که انجام داده‌ام به تو پناه می‌جویم، و به نعمتی که به من عطا نمودی اعتراف دارم، و به گناهانم اقرار می‌کنم، پس مرا بیامرز که گناهان را جز تو کسی نمی‌بخشد.`,
        1
    ),
    new Dhikr(
        '',
        '',
        'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً',
        `
        به ربوبیت الله، و به داشتن دین اسلام، و پیامبرى محمد –صلى الله علیه وسلم- راضى و خشنود هستم
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
        `

        `,
        4
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر',
        '',
        1
    ),
    new Dhikr(
        '',
        '',
        'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم',
        `
        ﷲ مرا کافی است؛ هیچ معبود (بر حقی) جز او وجود ندارد؛ بر او توکّل نمودم و او پروردگار عرش بزرگ است.
        `,
        7
    ),
    new Dhikr(
        '',
        '',
        'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم',
        `
        به نام ﷲ که با نام او هیچ چیزی در زمین و آسمان ضرر نمی‌رساند، و او شنوا و داناست.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ',
        `
        بارالها، با تو به شب می‌رسانیم، و با تو به صبح می‌رسانیم، و با تو زنده می‌شویم، و با تو می‌میریم، و زنده شدن مردگان به سوی توست.
        `,
        1
    ),
    new Dhikr(
        '',
        '',
        'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ',
        `
        بر فطرت اسلام شب را به صبح رساندیم، و بر کلمه‌ی اخلاص، و بر دین پیامبرمان محمد، و بر ملّت پدرمان ابراهیم حنیفِ مسلم (حق‌گرا)، که از مشرکان نبود.
        `,
        1
    ),
    new Dhikr(
        '',
        '',
        'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه',
        `
        ﷲ پاک و منزه و شایسته حمد و ستایش است، به تعداد مخلوقاتش و به اندازه‌ای که رضایت او حاصل گردد و به اندازه‌ی وزن عرشش و جوهرِ نوشتن کلماتش.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ',
        `
        بارالها، بدنم را عافیت ده، بارالها، شنوایی‌ام را عافیت ده، بارالها، بینایی‌ام را عافیت ده؛ هیچ معبود (بر حقی) جز تو وجود ندارد.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ',
        `
        بارالها، از کفر و فقر به تو پناه می‌برم. بارالها، من از عذاب قبر به تو پناه می‌برم؛ هیچ معبود (بر حقی) جز تو وجود ندارد.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي',
        `
        بارالها، از تو بخشش و سلامتی را در دنیا و آخرت می‌طلبم. بارالها، از تو بخشش و سلامتی را در دین و دنیا و خانواده و اموالم می‌طلبم. بارالها، عورت مرا بپوشان و مرا از ترس و وحشت در امان قرار ده. بارالها، مرا از روبرو، پشت سر، طرف راست و چپ و از بالای سر محافظت فرما. و به عظمت و بزرگی تو پناه می‌برم از اینکه در زمین فرو برم.
        `,
        1
    ),
    new Dhikr(
        '',
        '',
        'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ',
        `
        ای زنده‌ی پایدار به وسیله‌ی رحمتت، از تو کمک می‌طلبم، تمام امور مرا اصلاح بفرما، و مرا به اندازه‌ی یک چشم به هم زدن به نفسم وا مگذار.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا',
        '',
        1
    ),
    new Dhikr(
        '',
        '',
        'اللّهُـمَّ فاطِـرَ السّماواتِ وَالأرْضِ عالِـمَ الغَـيْبِ وَالشّـهادَةِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم',
        `
        بارالها، آفریننده آسمان‌ها و زمین، آگاه بر پنهان و آشکار، پروردگار همه چیزها و مالک آنها، گواهی می‌دهم که معبودی به حق غیر از تو نیست. به تو از شر نفس خود و شر شیطان و شرک (یا تله‌اش) و از این که نفس خود را به بدی (و گناه) دچار سازم یا آن بدی (و گناه) را به سوی مسلمانی روا دارم، پناه می‌برم.
        `,
        1
    ),
    new Dhikr(
        '',
        '',
        'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق',
        `
        پناه می‌برم به کلمات کامل ﷲ (یعنی قرآن) از شر آنچه آفریده است.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد',
        `
        بار الها! بر پیامبرمان محمد –صلى الله علیه وسلم- سلام و درود بفرست
        `,
        10
    ),
    new Dhikr(
        '',
        '',
        'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ',
        '',
        3
    ),
    new Dhikr(
        '',
        '',
        'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ',
        `
        'طلب آمرزش می‌کنم از خدای بزرگ که هیچ معبودی جز او نیست، زنده و پاینده است، و به سوی او بازمی‌گردم.
        `,
        3
    ),
    new Dhikr(
        '',
        '',
        'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ',
        `
        هیچ معبود (بر حقی) جز ﷲ نیست، یکتا است و هیچ شریکی ندارد، ملک و حمد و ستایش از آن اوست، و او بر همه چیز تواناست.
        `
        ,
        100
    ),
    new Dhikr(
        '',
        '',
        'سُبْحـانَ اللهِ وَبِحَمْـدِهِ',
        `
        پاک و ﻣﻨﺰه اﺳﺖ ﷲ و ﺣﻤﺪ و ﺳﺘﺎﻳﺶ ﺑﺮای اوﺳﺖ.
        `,
        100
    )
]);