import Collection from "@/models/collection.js";
import Dhikr from "@/models/dhikr.js";

export const ramadanCollection = new Collection('اذکار ماه رمضان', [
    new Dhikr(
        'دعای افطار',
        '',
        'اللَّهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ',
        'خدایا برای تو روزه گرفتم و با روزی تو افطار می‌کنم',
        1
    ),
    new Dhikr(
        'دعای روزه‌دار',
        '',
        'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِي',
        'خدایا، از تو می‌خواهم به رحمتت که همه چیز را فرا گرفته است، مرا ببخشی',
        10
    ),
    new Dhikr(
        'استغفار رمضان',
        '',
        'أَسْتَغْفِرُ اللَّهَ رَبِّي وَأَتُوبُ إِلَيْهِ',
        'از خداوند، پروردگارم آمرزش می‌طلبم و به سوی او بازمی‌گردم',
        100
    ),
    new Dhikr(
        'دعای شب قدر',
        '',
        'اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي',
        'خدایا تو بخشنده‌ای و بخشش را دوست داری، پس مرا ببخش',
        100
    ),
    new Dhikr(
        'دعای سحر',
        '',
        `اللَّهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ وَكَلِمَاتِكَ التَّامَّاتِ مِنْ شَرِّ مَا أَنْتَ آخِذٌ بِنَاصِيَتِهِ`,
        'خدایا! به ذات گرامی‌ات و کلمات کاملت، از شر هرچه که تو بر آن چیره هستی، پناه می‌برم',
        3
    ),
    new Dhikr(
        'سوره قدر',
        'بِسْمِ اللهِ الرَّحْمَـٰنِ الرَّحِيم',
        `إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ، وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ، لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ، تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ، سَلَامٌ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ`,
        'ما آن (قرآن) را در شب قدر نازل کردیم، و تو چه می‌دانی شب قدر چیست؟ شب قدر بهتر از هزار ماه است. فرشتگان و روح در آن به اذن پروردگارشان برای هر کاری نازل می‌شوند. آن شب، سلام و درود است تا طلوع سپیده دم.',
        10
    ),
    new Dhikr(
        'دعای نزول قرآن',
        '',
        `اللَّهُمَّ اجْعَلِ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي`,
        'خدایا! قرآن را بهار قلبم، نور سینه‌ام، زداینده‌ی اندوهم و برطرف کننده‌ی غمم قرار ده',
        7
    ),
    new Dhikr(
        'دعای قبولی روزه',
        '',
        `اللَّهُمَّ تَقَبَّلْ مِنِّي صِيَامِي وَقِيَامِي`,
        'خدایا! روزه و شب‌زنده‌داری‌ام را بپذیر',
        10
    ),
    new Dhikr(
        'تسبیحات ماه رمضان',
        '',
        `سُبْحَانَ مَنْ لا يَعْتَدِي عَلَى أَهْلِ مَمْلَكَتِهِ، سُبْحَانَ مَنْ لا يَأْخُذُ أَهْلَ الأَرْضِ بِأَلْوَانِ الْعَذَابِ، سُبْحَانَ الرَّؤُوفِ الرَّحِيمِ`,
        'پاک است آن که بر اهل فرمانروایی‌اش ستم نمی‌کند. پاک است آن که اهل زمین را به انواع عذاب‌ها فرو نمی‌گیرد. پاک است [خدای] مهربان و بخشاینده.',
        7
    )
]); 