import Collection from "@/models/collection.js";
import Dhikr from "@/models/dhikr.js";

export const specialCollection = new Collection('اذکار مناسبت‌های خاص', [
    new Dhikr(
        'دعای سفر',
        '',
        `اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الْأَهْلِ`,
        'الله بزرگ است، الله بزرگ است، الله بزرگ است، پاک و منزه است خدایی که این [مرکب] را برای ما رام ساخت وگرنه ما را توان آن نبود، و ما به سوی پروردگارمان بازمی‌گردیم. بار خدایا! ما در این سفرمان، از تو نیکی و تقوا می‌طلبیم و عملی که تو بدان راضی باشی. بار خدایا! این سفر را بر ما آسان گردان و دوری آن را برای ما نزدیک گردان. بار خدایا! تویی همراه در سفر و جانشین در خانواده.',
        1
    ),
    new Dhikr(
        'دعای بیمار',
        '',
        `اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَاسَ، اشْفِ أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا`,
        'پروردگارِ مردم، سختی را دور کن، شفا بده! تو شفادهنده‌ای، شفایی نیست جز شفای تو، شفایی که هیچ بیماری‌ای را باقی نگذارد.',
        3
    ),
    new Dhikr(
        'دعای استخاره',
        '',
        `اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِي بِهِ`,
        'بار الها به وسیله علمت از تو طلب خیر می‌کنم و به وسیله قدرتت از تو توانایی می خواهم و از تو فضل و بزرگی ات را مسئلت می نمایم. زیرا تو قادر و توانایی و من توانایی ندارم، و تو می دانی و من نمی دانم و تو به امورات غیب و پنهانی آگاه هستی. خدایا! اگر می دانی این كار برایم خیر است آن را برایم مقدر و آسان كن و در آن برکت بده و اگر می‎دانی این كار برایم شر است آن را از من دور کن و مرا از آن دور کن و خیر را هر كجا هست برایم مقدر کن و مرا به آن راضی کن.',
        1
    ),
    new Dhikr(
        'دعای باران',
        '',
        `اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا مَرِيئًا مُرِيعًا نَافِعًا غَيْرَ ضَارٍّ، عَاجِلًا غَيْرَ آجِلٍ`,
        'خدایا به ما باران ببار، خدایا به ما باران ببار، خدایا به ما باران ببار، خدایا به ما باران سودمند، گوارا، فراگیر، بی‌ضرر و زودرس ببار.',
        3
    ),
    new Dhikr(
        'دعای رفع اندوه',
        '',
        `لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ`,
        'معبودی جز خدای بزرگ و بردبار نیست. معبودی جز خدا که پروردگار عرش بزرگ است، نیست. معبودی جز خدا که پروردگار آسمان‌ها و زمین و عرش با کرامت است، نیست.',
        7
    ),
    new Dhikr(
        'دعای ازدواج',
        '',
        `اللَّهُمَّ بَارِكْ لَهُمَا، وَبَارِكْ عَلَيْهِمَا، وَاجْمَعْ بَيْنَهُمَا فِي خَيْرٍ`,
        'خدایا، به این دو برکت ده و برای آنها برکت قرار ده و آنها را در خیر و خوبی با هم جمع کن.',
        3
    ),
    new Dhikr(
        'دعای تبریک',
        '',
        `بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ`,
        'خدا به تو برکت دهد و برایت برکت قرار دهد و شما را در خیر با یکدیگر جمع کند.',
        1
    ),
    new Dhikr(
        'دعای هنگام مصیبت',
        '',
        `إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا`,
        'ما از آنِ خدا هستیم و به سوی او بازمی‌گردیم. خدایا! مرا در این مصیبت اجر عطا فرما و بهتر از آن را جایگزین کن.',
        1
    ),
    new Dhikr(
        'دعای هنگام خرید',
        '',
        `اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا جُبِلَتْ عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جُبِلَتْ عَلَيْهِ`,
        'خدایا! از تو خیر آن و خیر آنچه را که بر آن سرشته شده است، می‌خواهم و از شر آن و شر آنچه بر آن سرشته شده است، به تو پناه می‌برم.',
        1
    )
]); 