class Collection {
    constructor (name, adhkar) {
        this.name = name;
        this.adhkar = adhkar;
    }
}

class Dhikr {
    constructor(name, text, translation, count) {
        this.name = name;
        this.text = text;
        this.translation = translation;
        this.count = count;
    }
}

const morningCollection = new Collection('اذکار صبحگاه', [
    new Dhikr(
        'آیة الکرسی',
        `أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ<br>
        اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.`,
        'خدائی بجز الله وجود ندارد و او زنده‌ی پایدار (و جهان هستی را) نگهدار است. او را نه چرتی و نه خوابی فرا نمی‌گیرد (و همواره بیدار است و سستی و رخوت بدو راه ندارد). از آنِ او است آنچه در آسمانها و آنچه در زمین است (و در ملک کائنات، او را انبازی نیست). کیست آن که در پیشگاه او میانجیگری کند مگر با اجازه‌ی او؟ می‌داند آنچه را که در پیش روی مردمان است و آنچه را که در پشت سر آنان است (و مطّلع بر گذشته و حال و آینده، و آگاه بر بود و نبود جهان است و اصلاً همه‌ی زمانها و مکانها در پیشگاه علم او یکسان است. مردمان) چیزی از علم او را فراچنگ نمی‌آورند جز آن مقداری را که وی بخواهد....',
        1
    ),
    new Dhikr(
        'سوره ی اخلاص',
        `بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم.<br>
        قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ`,
        `
        بگو: خدا، یگانه‌ی یکتا است.
        خدا، سَرورِ والای برآورنده‌ی امیدها و برطرف‌کننده‌ی نیازمندیها است.خدا، سَرورِ والای برآورنده‌ی امیدها و برطرف‌کننده‌ی نیازمندیها است.
        نزاده است و زاده نشده است.
        و کسی همتا و همگون او نمی‌باشد.
        `,
        3
    ),
]);